# ExternalServices.BuiltInExternalServices Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices Class
ExternalServices Class Members See Also
---
A collection of ids for external services that are managed and used by Revit directly.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class BuiltInExternalServices
```

Visual Basic
---
```text
Public NotInheritable Class BuiltInExternalServices
```

Visual C++
---
```text
public ref class BuiltInExternalServices abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.ExternalService..::..ExternalServices..::..BuiltInExternalServices
# See Also
ExternalServices..::..BuiltInExternalServices Members
Autodesk.Revit.DB.ExternalService Namespace